# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2fCIB, [1024, True, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

# YOLOv8.0n head
head:
  - [6, 1, Conv, [256, 3, 2]] # 11-P5/32    #   256 20 20
  - [[-1, 10], 1, Concat, [1]] # 12         #   1280 20 20
  - [-1, 3, C2fCIB, [1024, True, True]] # 13-P5/32  1024 20 20

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14-P4/16   1024 40 40
  - [4, 1, Conv, [256, 3, 2]] # 15-P4/16                  256 40 40
  - [[-1, -2, 6], 1, Concat, [1]] # 16                 40 40
  - [-1, 3, C2f, [512]] # 17-P4/16           512  40 40

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18-P3/8   # 512  80 80
  - [2, 1, Conv, [128, 3, 2]] # 19-P3/8     128  80 80
  - [[-1, -2, 4], 1, Concat, [1]] # 20     80 80
  - [-1, 3, C2f, [256]] # 21-P3/8    256  80 80

  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ] # 22-P3/8   # 256  160 160
  - [ [-1,  2], 1, Concat, [ 1 ] ] # 23     160 160
  - [ -1, 3, C2f, [128 ] ] # 24-P3/8    128  160 160

  - [[22, -1], 1, Concat, [1]] # 25  #  160 160
  - [-1, 3, C2f, [128]] # 26-P3/8   #128 160 160

  - [22, 1, Conv, [256, 3, 2]] # 27-P4/16  #256 80 80
  - [26, 1, Conv, [256, 3, 2]] # 28-P4/16   #256 80 80
  - [[-1, -2, 21, 18,4], 1, Concat, [1]] # 29-P4/16  #2048  80 80
  - [-1, 3, C2f, [256]] # 30-P4/16     256  80 80


  - [27, 1, Conv, [512, 3, 2]] # 31-P5/32  #        512  40 40
  - [30, 1, Conv, [512, 3, 2]] # 32-P5/32           512  40 40
  - [[-1, -2,  14,17,5], 1, Concat, [1]] # 33-P5/32       #2048 40 40
  - [-1, 3, C2fCIB, [512, True, True]] # 34-P5/32  #1024 40 40


  - [14, 1, Conv, [512, 3, 2]] # 35-P5/32  #        512  20 20
  - [17, 1, Conv, [512, 3, 2]] # 36-P5/32           512  20 20
  - [[-1, -2, 11,8], 1, Concat, [1]] # 37-P5/32       #2048 20 20
  - [-1, 3, C2fCIB, [1024, True, True]] # 38-P5/32  #1024 20 20

  - [[26,30, 34,38], 1, v10Detect, [nc]] # Detect(P3, P4, P5)

